<?php

// Дії з числами

// Залишок від ділення 7 на 3
$remainder = 7 % 3;

// Ціла частина від ділення 7 на 7,15
$int_division = intdiv(7, 7.15);

// Корінь квадратний із 25
$sqrt_25 = sqrt(25);


// Дії зі строками

$phrase = "Десять негритят пошли купаться в море";

// Отримати 4-е слово з фрази
$words = explode(" ", $phrase);
var_dump($words[3]);

// Отримати 17-й символ із фрази
$seventeenth_char = mb_substr($phrase, 16, 1);

// Зробити великою кожну першу букву слів фрази
$capitalized_phrase = mb_convert_case($phrase, MB_CASE_TITLE, "UTF-8");

// Порахувати довжину строки
$length_of_phrase = mb_strlen($phrase);


// Дії з логічними даними

// Чи вірно, що true дорівнює 1
$is_true_equals_one = (true == 1);

// Чи вірно, що false тотожно 0
$is_false_identical_zero = (false === 0);

// Порівняння строк та чисел

// Порівняти строки "three" і "три"
$str1 = "three";
$str2 = "три";

if (mb_strlen($str1) > mb_strlen($str2)) {
    var_dump("$str1 більше");
} else if (mb_strlen($str1) < mb_strlen($str2)) {
    var_dump("$str2 більше");
} else {
    var_dump("Рядки однакової довжини");
}

// Яке число більше: 125 * 13 + 7 або 223 + 28 * 2
$calculation1 = 125 * 13 + 7;
$calculation2 = 223 + 28 * 2;
$max_number = max($calculation1, $calculation2);

?>

<!-- Оператор % використовується для знаходження залишку від ділення.
intdiv() — для знаходження цілої частини від ділення.
sqrt() — для обчислення кореня квадратного.
explode() — для розділення фрази на масив слів.
mb_substr() — для отримання певного символа з урахуванням кодування UTF-8.
mb_convert_case() — для зміни регістру першої літери кожного слова.
mb_strlen() — для підрахунку довжини строки з урахуванням багатобайтових символів.
Оператори == і === використовуються для порівняння значень з урахуванням або без урахування типу.
max() — для знаходження максимального значення з двох чисел. -->